import React, { useEffect, useRef, useState } from "react";
import styled from "styled-components";
import { withRouter } from "react-router-dom";
import { news } from "../data";
import Word from "../Components/Word";
import Draggable from "react-draggable";
import Histogram from "../Components/Histogram";

const Wrapper = styled.div`
  margin: 0 auto;
  margin-top: 3rem;
  width: 100%;
  min-height: 80vh;
  padding: 0 0;
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
  line-height: 2rem;
`;

const LevelControl = styled.div`
  width: 200px;
  height: 380px;
  border: 1px solid #d6d6d6;
  background-color: rgba(255, 255, 255, 1);
  position: fixed;
  top: 300px;
  right: 50px;
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
  border-radius: 0px;
  background: #ffffff;
  box-shadow: 5px 5px 10px #e6e6e6, -5px -5px 10px #ffffff;
  &:hover {
    cursor: move;
  }
`;

const Control = styled.div`
  width: 200px;
  height: 150px;
  border: 1px solid #d6d6d6;
  background-color: rgba(255, 255, 255, 1);
  position: fixed;
  top: 720px;
  right: 50px;
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
  border-radius: 0px;
  background: #ffffff;
  box-shadow: 5px 5px 10px #e6e6e6, -5px -5px 10px #ffffff;
  &:hover {
    cursor: move;
  }
`;

const HistogramWrapper = styled.div`
  width: 400px;
  height: 150px;
  border: 1px solid #d6d6d6;
  background-color: rgba(255, 255, 255, 1);
  position: fixed;
  top: 100px;
  right: 50px;
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
  border-radius: 0px;
  background: #ffffff;
  box-shadow: 5px 5px 10px #e6e6e6, -5px -5px 10px #ffffff;
  user-select: none;
  div.title:hover {
    cursor: move;
  }
`;

const Button = styled.div`
  width: 80%;
  height: 50px;
  display: flex;
  justify-content: center;
  align-items: center;
  margin-bottom: 10px;
  font-size: 0.8rem;
  &:hover {
    cursor: pointer;
  }
`;

const PREHIGHLIGHT_NEWS = `[["디지털",0],["법가,",0],["감시",0],["자본주의",0],["신세계를",0],["열다",0],["<br/>",0],["<br/>",0],["최첨단",0],["인공지능",0],["기술을",0],["활용한",0],["역사상",0],["가장",0],["강력한",0],["감시",0],["시스템은",0],["중앙권력이",0],["‘백성’",0],["개개인을",0],["완벽하게",0],["통제하려는",0],["진시황의",0],["이상을",0],["현실로",0],["구현하는",0],["듯하다.",0],["시진핑",0],["주석은",0],["“법을",0],["받드는",0],["이가",0],["강하면",0],["국가가",0],["강해지고,",0],["법을",0],["받드는",0],["이가",0],["약하면",0],["나라가",0],["약해진다”고",0],["했다.",0],["모든",0],["권력자들이",0],["꿈꿨던",0],["법가적",1],["빅브러더",1],["사회가",1],["21세기",1],["첨단기술로",1],["실현되고",1],["있다.",1],["<br/>",0],["<br/>",0],["2012년",0],["23살",1],["대학원생",1],["인치(印奇)가",1],["베이징",0],["중관춘(중국판",0],["실리콘밸리)에서",0],["친구",0],["둘과",0],["함께",0],["안면인식",1],["인공지능(AI)",1],["관련",1],["스타트업인",1],["메그비(Megvii·曠視)를",3],["설립했다.",2],["그는",0],["칭화대학교에서",0],["이공계",0],["분야",0],["최고",0],["수재들만",0],["모이는",0],["컴퓨터과학실험반을",0],["졸업하고,",0],["전액",0],["장학금을",0],["받아",0],["미국",0],["컬럼비아대학",0],["컴퓨터공학",0],["석사과정을",0],["밟고",0],["있는",0],["중이었다.",0],["‘야오반’(姚班)이라고",1],["하는",1],["칭화대",1],["컴퓨터과학실험반은",1],["세계적",1],["컴퓨터",1],["공학자인",1],["야오치즈",1],["교수가",1],["중국",1],["과학기술",1],["분야",1],["최고",1],["인재들을",1],["길러내는",1],["것으로",1],["유명한데,",1],["메그비의",1],["공동",1],["설립자인",1],["인치와",1],["탕원빈,",1],["양무는",1],["모두",1],["여기서",1],["함께",1],["공부한",1],["동창생이다.",1],["<br/>",0],["<br/>",0],["대학",0],["시절",0],["이들",0],["셋이",0],["재미",0],["삼아",0],["개발한",0],["안면인식",0],["앱이",0],["주목을",0],["받자,",0],["사업",0],["기회를",0],["발견한",0],["이들이",0],["창업에",0],["나섰다.",0],["이들이",0],["내놓은",0],["세계에서",1],["가장",1],["정확한",1],["안면인식",1],["알고리즘",1],["‘Face++’는",3],["‘대박’을",1],["터뜨렸다.",1],["2016년",0],["의",0],["10대",0],["혁신기술에",0],["선정됐고,",0],["중국",0],["최대",0],["전자상거래",0],["업체",0],["알리바바가",0],["이",0],["기술을",0],["이용해",0],["안면인식",0],["결제시스템을",0],["채택했다.",0],["식사나",1],["쇼핑을",1],["마친",1],["뒤",1],["전자결제시스템에",1],["접속해",1],["얼굴",1],["셀카",1],["사진을",1],["찍으면",1],["3초",1],["안에",1],["누구인지",1],["인식해",1],["연결된",1],["계좌에서",1],["자동으로",1],["결제가",1],["이뤄진다.",1],["국내외에서",0],["투자가",0],["밀려들었고,",0],["중국은행,",0],["폭스콘,",0],["중국",0],["각지의",0],["지방정부,",0],["공항",0],["등에서",0],["이들의",0],["기술을",0],["도입했다.",0],["은행이나",0],["회사,",0],["공항,",0],["기차역",0],["등에서도",0],["스쳐",0],["지나가며",0],["자동으로",0],["신분을",0],["확인한다.",0],["중국",1],["인터넷",1],["금융기업의",2],["85%",2],["이상이",2],["메그비의",1],["안면인식",1],["기술을",1],["사용한다.",1],["메그비는",0],["4차",0],["산업혁명이",0],["싹트던",0],["시대의",0],["흐름을",0],["타고",0],["하늘로",0],["날아올랐다.",0],["<br/>",0],["<br/>",0],["이",0],["기술에",0],["주목한",0],["또",1],["다른",1],["주요",1],["고객이",1],["있었으니,",0],["중국",1],["공안기구다.",1],["시진핑",0],["시대",0],["중국은",1],["파업,",1],["토지분쟁,",1],["소수민족",1],["저항",1],["등",1],["사회",1],["불안에",1],["대응해",1],["감시·통제를",2],["전면",2],["강화하는",2],["정책을",2],["추진했다.",1],["중국공산당",0],["중앙정치법률위원회(정법위원회)",0],["주도로",0],["도시에서는",0],["‘톈왕’(天網),",0],["향촌지역에서는",0],["‘쉐량’(雪亮)",0],["공정을",0],["시작했다.",0],["톈왕은",1],["도시",1],["말단의",1],["행정단위인",1],["사구(社區)를",1],["좀",1],["더",1],["작은",1],["규모의",1],["격자(網格)로",1],["나눠",1],["각각",1],["관리인을",1],["배치해",1],["관할지역의",1],["모든",1],["상황을",1],["관리·감시하게",1],["했다.",1],["“군중의",0],["눈은",0],["눈(雪)처럼",0],["밝다(亮)”는",0],["마오쩌둥의",0],["말에서",0],["따온",0],["쉐량",0],["역시",0],["각",0],["지역",0],["주민들이",0],["이웃을",0],["철저히",0],["감시하도록",0],["한",0],["것이다.",0],["메그비의",0],["‘페이스++’(Face++)",0],["안면인식",0],["알고리즘은",0],["톈왕과",0],["쉐량",0],["공정을",0],["완벽하게",0],["만들",0],["화룡점정의",0],["기술이었다.",0],["2015년",0],["공안부는",0],["2020년까지",0],["전국에",0],["완전한",0],["영상",0],["감시",0],["네트워크를",0],["구축하겠다고",0],["발표했다.",0],["이후",0],["중국",1],["구석구석에",1],["수억",1],["대의",1],["감시카메라를",1],["설치해",1],["촬영한",1],["인민들의",1],["얼굴",1],["정보를",1],["실시간",1],["분석해",1],["공안이",1],["표적으로",1],["삼은",1],["대상을",1],["식별해내고",1],["있다.",1],["안면인식,",0],["빅데이터,",0],["인공지능의",0],["딥러닝",0],["기술이",0],["결합되는데,",0],["정확도는",0],["상상을",0],["초월한다.",0],["2018년",1],["장시성",1],["난창에서",1],["열린",1],["콘서트에서",1],["5만명",2],["관중",2],["가운데서",2],["수배",2],["중이던",2],["남성을",2],["곧바로",2],["찾아내",2],["검거했다.",1],["어떤",0],["사람이",0],["계속",0],["지하철역에",0],["오는데",0],["직원이",0],["아니라면",0],["도둑일",0],["가능성이",0],["있다는",0],["식으로",0],["시스템이",0],["스스로",0],["분석해",0],["이상",0],["신호를",0],["곧바로",0],["공안에",0],["전송한다.",0],["공안부는",1],["메그비의",1],["안면인식",1],["기술을",1],["이용해",1],["2016년",2],["이후",2],["5천명",2],["이상의",2],["범죄자를",2],["체포했다고",2],["밝혔다.",1],["<br/>",0],["<br/>",0],["이",0],["거대한",0],["감시",0],["시스템에는",0],["메그비",0],["외에도",0],["센스타임(商湯科技),",1],["이투테크놀로지",1],["같은",0],["안면인식·인공지능",0],["관련",0],["민간",0],["스타트업들,",0],["음성인식",0],["장비",0],["기업인",0],["아이플라이텍(iFlytek·科大訊飛),",1],["세계",0],["최대의",0],["감시용",0],["시시티브이(CCTV)를",0],["제조하는",0],["국유기업",0],["하이크비전(海康威視)과",1],["다화테크놀로지,",1],["네트워크",0],["기업",0],["화웨이",1],["등이",0],["참여하고",0],["있다.",0],["<br/>",0],["<br/>",0],["이",0],["기술이",0],["가장",0],["집약적으로",0],["사용된",0],["곳이",0],["중국",0],["북서부",1],["신장위구르자치구다.",1],["소수민족",2],["위구르인",2],["100만명을",2],["‘재교육",2],["캠프’에",2],["강제수용한",2],["것으로",1],["알려져",1],["논란이",1],["된",1],["이곳에서,",1],["공안은",1],["시장,",1],["학교,",1],["모스크",1],["등",1],["일상생활의",1],["전",1],["영역에",1],["감시카메라와",1],["데이터처리",1],["장비,",1],["클라우드",1],["저장",1],["장치,",1],["드론",1],["감시",1],["시스템을",1],["설치해",1],["주민들의",2],["일거수일투족을",2],["감시한다.",2],["중국",0],["당국이",0],["신장의",0],["감시",0],["시스템에",0],["투자하는",0],["막대한",0],["예산은",0],["관련",0],["기업으로",0],["흘러들어가",0],["이들",0],["기업을",0],["급성장시키고",0],["기술을",0],["더욱",0],["업그레이드한다.",0],["<br/>",0],["<br/>",0],["2019년",0],["10월8일",0],["미국",1],["상무부는",1],["신장에서",1],["위구르인들에",2],["대한",2],["인권",2],["탄압에",2],["관여했다는",2],["이유로",2],["메그비,",1],["센스타임,",1],["화웨이",1],["등",1],["8개",2],["기업을",2],["블랙리스트에",2],["올려,",2],["미",1],["상무부의",1],["승인",1],["없이는",1],["반도체칩",1],["등",1],["미국",1],["첨단기술",1],["부품을",1],["살",1],["수",1],["없도록",1],["했다.",1],["하지만",0],["이들",0],["기업은",0],["계속해서",0],["투자를",0],["끌어들이며",0],["여전히",0],["승승장구하고",0],["있다.",0],["<br/>",0],["<br/>",0],["이제",0],["32살이",0],["된",0],["인치는",0],["중국의",0],["스타",0],["기업인이다.",0],["그는",0],["2019년",0],["홍콩",0],["<사우스차이나",0],["모닝포스트>",0],["인터뷰에서",0],["“알고리즘은",0],["아름답고",0],["명료하고",0],["우아한",0],["것”이라고",0],["말했다.",0],["신장에서",0],["인권",0],["탄압에",0],["그",0],["기술이",0],["사용된다는",0],["비판에",0],["대해서는",0],["“기술은",3],["결코",3],["잘못이",3],["없으며,",3],["책임은",3],["사람이",3],["져야",3],["한다”고만",3],["답했다.",1],["<br/>",0],["<br/>",0],["‘4차",1],["산업혁명’으로",1],["각광받는",1],["안면·음성인식,",1],["인공지능,",1],["빅데이터",1],["기술은",1],["‘감시",2],["자본주의’의",2],["핵심이다.",1],["실은",0],["‘감시",3],["자본주의’가",3],["중국에만",3],["존재하는",3],["것이",3],["아니다.",3],["구글,",0],["페이스북,",0],["인스타그램,",0],["네이버,",0],["카카오톡,",0],["틱톡",0],["등",0],["수많은",1],["첨단",1],["정보기술",1],["기업들이",1],["‘무료로’",1],["서비스를",1],["제공하지만,",1],["실제로는",2],["사용자들의",2],["개인정보를",3],["추출해,",3],["개인들의",2],["성향과",2],["행동,",2],["특징을",2],["파악하고",2],["상품화해",2],["거액을",1],["벌어들인다.",1],["<br/>",0],["<br/>",0],["이",0],["미래산업에서",0],["중국",0],["기업들은",0],["미국이나",0],["다른",0],["‘선진국’",0],["기업들을",0],["제치고",0],["선두",0],["주자로",0],["대약진했다.",0],["우선",1],["14억",1],["인구에서",1],["나오는",1],["빅데이터를",1],["기업과",1],["정부가",1],["제한",1],["없이",1],["활용하기",1],["때문이다.",1],["혼란을",0],["두려워하고",0],["안정을",0],["원하는",0],["인민이",0],["감시",0],["시스템이",0],["등장한",0],["뒤",0],["범죄가",0],["줄고,",0],["생활이",0],["편리해지는",0],["것을",0],["반기는",0],["측면도",0],["분명",0],["존재한다.",0],["중국",1],["당국은",1],["범죄와",2],["테러,",2],["재난의",2],["위험으로부터",2],["시민들을",2],["보호한다는",2],["명분으로",2],["세계에서",1],["가장",1],["강력한",1],["감시망을",1],["구축했고",1],["이를",0],["통해",0],["수집되는",0],["방대한",0],["데이터는",0],["중국의",0],["인공지능",0],["관련",0],["산업에",0],["다른",0],["나라",0],["기업들은",0],["상상하기",0],["힘든",0],["유리한",0],["환경을",0],["조성했다.",0],["당국은",0],["주민들의",0],["얼굴을",0],["여러",0],["각도에서",0],["촬영하고",0],["지문,",0],["홍채",0],["정보까지",0],["등록시키고",0],["있다.",0],["‘중국제조",0],["2025’",0],["정책을",0],["통해",0],["중국",0],["정부가",0],["대규모",0],["자금을",0],["이들",0],["미래산업에",0],["전략적으로",0],["투입해",0],["전폭",0],["지원한",0],["것도",0],["이들",0],["기업이",0],["세계",0],["최강으로",0],["급성장한",0],["동력이",0],["되었다.",0],["<br/>",0],["<br/>",0],["감시카메라,",1],["안면·홍채인식",1],["등",1],["바이오",1],["감시",1],["기술과",1],["관련해",1],["2017년",1],["한",1],["해",1],["동안",1],["중국",2],["기업은",2],["530건의",2],["특허를",2],["출원해",1],["미국의",2],["96건을",2],["월등히",1],["앞섰다.",1],["국외에서",0],["퉁팡이라는",0],["중국",0],["기업의",0],["이름을",0],["들어본",0],["사람은",0],["드물지만,",0],["이",0],["회사의",0],["자회사인",0],["‘눅텍’(Nuctech)는",0],["100개국",0],["이상의",0],["공항과",0],["국경의",0],["보안",0],["검색",0],["장비를",0],["판매했다.",0],["하이크비전은",0],["2010년에는",0],["매출",0],["기준",0],["세계",0],["10위의",0],["감시카메라",0],["제조업체였지만",0],["2016년에서는",0],["1위",0],["업체가",0],["됐다.",0],["2018년",1],["세계",1],["20대",1],["감시카메라",1],["업체",1],["가운데",1],["6개가",1],["중국",1],["기업이다.",1],["<br/>",0],["<br/>",0],["14억",0],["인민을",0],["상대로",0],["모이는",0],["방대한",0],["데이터를",0],["처리하는",0],["클라우드",0],["컴퓨팅,",0],["저장,",0],["인공지능",0],["분석이",0],["핵심",0],["기술이다.",0],["더",0],["철저히",0],["감시하면",0],["더",0],["많은",0],["빅데이터가",0],["모이고,",0],["기술과",0],["사업은",0],["더",0],["급속도로",0],["성장한다.",0],["감시와",0],["산업,",0],["돈이",0],["하나로",0],["얽힌",0],["‘위대한",0],["신세계’다.",0],["2019년",1],["저장성",1],["항저우시의",1],["한",1],["고등학교에서는",1],["안면인식",1],["기술을",1],["활용해",1],["학생",2],["개개인의",2],["표정을",2],["분석해",2],["얼마나",2],["수업에",2],["집중하는지를",2],["감시하고",2],["있다는",2],["보도가",2],["나와",1],["논란이",1],["일기도",1],["했다.",1],["많은",0],["공장에선",0],["노동자들의",0],["표정과",0],["동작,",0],["작업량을",0],["실시간으로",0],["분석해",0],["얼마나",0],["열심히",0],["근무하는지를",0],["감시한다.",0],["<br/>",0],["<br/>",0],["시민이",3],["견제·감시할",3],["힘이",3],["없는",3],["중국에서",2],["‘4차",1],["산업혁명’은",1],["이처럼",1],["‘감시",2],["자본주의’의",2],["본질을",1],["더욱",1],["뚜렷이",1],["드러내는",1],["동안",1],["기술은",1],["더욱",1],["급속하게",1],["발전한다.",1],["당은,",0],["기업은,",0],["권력,",0],["질서는",0],["언제",0],["어디서나",0],["당신의",0],["일거수일투족을",0],["파악하고",0],["있다.",0],["중국",0],["당국은",0],["한",0],["단계",0],["더",0],["나아가",0],["‘사회신용시스템’(社會信用體系)을",2],["구축하고",0],["있다.",0],["2018년부터",0],["여러",0],["도시에서",0],["시범",0],["실시",0],["중인",0],["이",0],["시스템은",0],["개개인의",1],["일상",1],["행동에",1],["점수를",1],["매겨",1],["혜택",1],["또는",1],["처벌을",1],["하는",1],["개념이다.",1],["교통법규",0],["위반은",0],["감점,",0],["은행",0],["신용도가",0],["높으면",0],["점수가",0],["올라가는",0],["식이다.",0],["사회신용점수",1],["총점이",1],["높은",1],["사람은",1],["은행에서",1],["낮은",1],["이자로",1],["쉽게",1],["돈을",1],["빌리고,",1],["점수가",1],["낮으면",1],["취업이나",1],["대학",1],["입시에서",1],["감점을",1],["당하거나,",1],["비행기나",1],["기차표를",1],["살",1],["수",1],["없게",1],["된다.",1],["실제로",0],["국가발전개혁위원회는",0],["2019년",0],["6월",0],["발표한",0],["통계에서",0],["사회신용점수가",0],["낮은",0],["이들에게",0],["2682만장의",0],["비행기",0],["티켓과",0],["596만장의",0],["고속열차표",0],["구매가",0],["거부되었다고",0],["밝혔다.",0],["이",1],["시스템이",1],["전면",1],["도입되면,",1],["스마트폰,",1],["감시카메라,",1],["디지털",1],["화폐",1],["사용",1],["정보를",1],["결합해,",1],["14억",1],["인민의",1],["모든",1],["행동과",1],["이동,",1],["소비,",1],["금융,",1],["의료",1],["정보를",1],["파악해",1],["개개인의",3],["신용을",3],["점수화할",3],["수",1],["있게",1],["된다.",1],["이론적으로는",0],["국가가",0],["한",0],["사람의",0],["이동",0],["기록,",0],["친구",0],["관계,",0],["지인,",0],["책과",0],["글,",0],["자료를",0],["읽는",0],["습관",0],["등을",0],["근거로",0],["반정부",1],["활동에",1],["나설",1],["가능성을",1],["‘사전에’",1],["예측해",1],["제재에",1],["나설",1],["수",1],["있다는",1],["전망까지",1],["나온다.",0],["<br/>",0],["<br/>",0],["최첨단",0],["인공지능",0],["기술을",0],["활용한",0],["역사상",0],["가장",0],["강력한",0],["감시",0],["시스템은",0],["중앙권력이",0],["‘백성’",0],["개개인을",0],["완벽하게",0],["통제하려는",0],["진시황의",0],["이상을",0],["현실로",0],["구현하는",0],["듯하다.",0],["2014년",0],["전국인민대표대회",0],["60주년",0],["기념행사에서",0],["시진핑",0],["주석은",0],["“법을",0],["받드는",0],["이가",0],["강하면",0],["국가가",0],["강해지고,",0],["법을",0],["받드는",0],["이가",0],["약하면",0],["나라가",0],["약해진다”고",0],["했다.",0],["모든",1],["권력자들이",1],["꿈꿨던",1],["법가적",1],["빅브러더",1],["사회가",1],["21세기",1],["첨단기술로",1],["실현되고",1],["있다.",1]]`;
// const PREHIGHLIGHT_EXIT = `[["<엑시트>,",0],["뛰어난",0],["유머와",0],["긴장으로",0],["현재를",0],["담았다",0],["<br/>",0],["평범한",0],["것들의",0],["비범한",0],["연결",0],["<br/>",0],["<br/>",0],["“평범한",1],["코미디언은",1],["재미있는",1],["것을",1],["연기하지만",1],["훌륭한",1],["코미디언은",1],["평범한",1],["것을",1],["재미있게",1],["만든다.”",1],["버스터",0],["키튼의",0],["말이다.",0],["키튼의",0],["후예임이",0],["분명한",0],["이상근",0],["감독이",0],["우선해서",0],["꾸린",0],["것은",0],["2019년에",0],["즈음한",0],["한국",0],["사회의",0],["풍경이다.",0],["청년",0],["백수",0],["용남(조정석)은",0],["딸",0],["셋",0],["있는",0],["집",0],["아들이다.",0],["1970~80년대에",0],["지어졌을",0],["단독주택에서",0],["부모와",0],["함께",0],["산다.",0],["연회장",0],["부점장",0],["의주(윤아)에겐",0],["감정노동이",0],["만만치",0],["않다.",0],["건물주",0],["아들인",0],["점장이",0],["치근댄다.",0],["3대가",0],["모여",0],["트로트",0],["가요를",0],["부르는",0],["칠순",0],["잔치.",0],["유럽",0],["고성을",0],["모방한",0],["‘구름정원",0],["컨벤션홀’",0],["외벽에는",0],["어김없이",0],["사자상이",0],["포효하고",0],["있다.",0],["고대",0],["지중해",0],["연안",0],["제국과",0],["중세",0],["유럽",0],["대륙의",0],["건축양식이",0],["마구",0],["뒤섞여",0],["있다.",0],["내부에",0],["라일락룸과",0],["페퍼민트홀을",0],["갖췄음은",0],["물론이다.",0],["주변",0],["상가",0],["건물들엔",0],["오색찬란한",0],["네온사인",0],["간판이며",0],["현수막이",0],["난립해",0],["있다.",0],["미세먼지",0],["수치가",0],["‘나쁨’을",0],["가리킨",0],["날,",0],["가스",0],["테러가",0],["발생한다.",0],["현장에",0],["가장",0],["먼저",0],["도착한",0],["건",0],["구급차가",0],["아니라",0],["사설",0],["견인차다.",0],["유독가스는",0],["걷잡을",0],["수",0],["없이",0],["퍼져가고",0],["인물들은",0],["위험",0],["지역에서",0],["탈출해야",0],["한다.",0],["<엑시트>는",1],["평범한",1],["상황과",1],["지형지물들로",1],["화면을",1],["밀도",1],["높게",1],["채운",1],["다음",1],["이를",1],["유머와",1],["긴장으로",1],["바꾼다.",1],["인지심리학자",0],["로버트",0],["W.",0],["와이스버그는",0],["다음과",0],["같이",0],["정의한다.",0],["“창의란,",1],["평범한",1],["것들의",1],["비범한",1],["연결이다.”",1],["<br/>",0],["<br/>",0],["‘지금",0],["저기’를",0],["본다는",0],["것",0],["<br/>",0],["<br/>",0],["여기까지는",0],["표면적인",0],["얘기다.",0],["<엑시트>의",0],["내면에선",0],["‘보는",1],["행위’에",1],["대해",1],["자못",1],["심각한",1],["이야기를",1],["꺼내고",1],["있다.",1],["언젠가부터",1],["우리는",1],["재난을",3],["‘본다’.",3],["용남이",0],["건물을",0],["뛰어넘을",0],["때부터",0],["가족들은",0],["그를",0],["본다.",0],["시야에서",0],["벗어나도",0],["부모는",0],["화상통화를",0],["연결해",0],["아들을",0],["본다.",0],["구조",0],["헬기",0],["탑승인원",0],["제한으로",0],["생이별했어도",0],["드론",0],["카메라와",0],["무선",0],["통신이",0],["주인공들을",0],["방송한다.",0],["아버지(박인환)가",0],["드론",0],["촬영팀을",0],["만나",0],["목놓아",0],["애원하는",0],["건",0],["아들의",0],["모습을",0],["‘보여달라’는",0],["것이다.",0],["인류가",0],["본격적으로",0],["먼",0],["곳의",0],["재난을",0],["보기",0],["시작하기는",0],["1990년",0],["걸프전부터였을",0],["것이다.",0],["미군과",0],["군수산업체들은",0],["첨단",0],["미사일의",0],["정밀",0],["타격",0],["영상을",0],["언론에",0],["제공했다.",0],["<CNN>은",0],["일약",0],["국제적인",0],["스타",0],["방송사로",0],["떠올랐다.",0],["이후",0],["우리는",0],["뉴욕",0],["월드트레이드센터에",0],["돌진한",0],["항공기를",0],["봤고,",0],["보스턴마라톤대회",0],["도중",0],["터진",0],["폭탄을",0],["봤다.",0],["그런데",0],["정확히",0],["보자.",0],["우리가",1],["본",1],["건",1],["방송사",1],["취재진이",1],["출동해",1],["촬영한",1],["‘사건",2],["이후’의",2],["영상이",2],["아니다.",2],["재난의",2],["현재가",2],["담긴",2],["‘지금",2],["저기’의",2],["실황이다.",2],["이걸",1],["가능케",1],["한",1],["건",1],["이",1],["시대의",1],["평범한",1],["풍경으로",1],["자리잡은",1],["테크놀로지다.",1],["우리는",0],["사람보다",0],["카메라가",0],["많은",0],["시대에",0],["산다.",0],["국내",0],["등록된",0],["스마트폰",0],["5천만대.",0],["요즘",0],["스마트폰엔",0],["눈(렌즈)이",0],["대여섯개씩",0],["달려",0],["있다.",0],["차량마다",0],["장착된",0],["수백만대의",0],["블랙박스는",0],["도로를",0],["달리는",0],["눈이다.",0],["드론은",0],["하늘을",0],["나는",0],["눈이다.",0],["여기에",0],["전국",0],["곳곳을",0],["들여다보고",0],["있는",0],["CCTV와",0],["IP카메라까지.",0],["렌즈들은",0],["5G시대",0],["연결망에",0],["의해",0],["실시간",0],["영상을",0],["전세계와",0],["공유한다.",0],["<br/>",0],["<br/>",0],["이제",0],["<엑시트>",0],["속",0],["평범한",1],["테크놀로지의",1],["풍경이",1],["어떤",1],["비범함으로",1],["연결되는지",1],["짚을",0],["순서다.",0],["탈출해야",0],["하는",0],["이들",0],["중에는",0],["학생들도",0],["있었다.",0],["아이들은",0],["밤늦도록",0],["‘1등",0],["보습학원’에",0],["남아",0],["있었다.",0],["탈출구는",0],["어른들의",0],["편의에",0],["의해",0],["잠겼다.",0],["학생들이",0],["창문",0],["저편에서",0],["울부짖는다.",0],["한국",0],["사회의",0],["보편적인",0],["풍경이",0],["특수한",0],["집단기억과",0],["만나는",0],["순간이다.",0],["건너편",0],["건물",0],["옥상에서",0],["이를",0],["지켜보는",0],["두",0],["주인공은,",0],["다시",0],["말해",0],["선의를",0],["가진",0],["어른들은,",0],["아이들에게",0],["갈",0],["수",0],["없다.",0],["이를",0],["보이는",0],["카메라",0],["역시",0],["건물",0],["저쪽으로",0],["건너가지",0],["않는다.",0],["볼",1],["수",1],["있지만",1],["가닿을",1],["수",1],["없는",1],["고문",1],["같은",1],["상황.",1],["이를",0],["연출한",0],["감독의",0],["뜻은",0],["이",0],["영화의",0],["오락성",0],["못지않게",0],["비범하다.",0],["구조",0],["기회를",0],["아이들에게",0],["양보한",0],["용남과",0],["의주가",0],["뛰고",0],["매달리는",0],["사이",0],["방송사",0],["보도국장은",0],["영상을",0],["입수하기",0],["위해",0],["사설",0],["드론",0],["촬영팀을",0],["매수한다.",0],["보도국장은",0],["지금",0],["저기,",0],["강",0],["건너",0],["불을",0],["구경시켜줌으로써",0],["＜CNN＞이",0],["되고",0],["싶었을",0],["것이다.",0],["여기서부터다.",0],["시민들은",1],["이걸",1],["‘지금",3],["여기’의",3],["일로",3],["만든다.",2],["팔짱",1],["끼고",1],["구경만",2],["하고",2],["앉아",2],["있지",2],["않았다.",2],["저마다",1],["장비를",1],["동원해",1],["응원을",1],["넘어",1],["구조의",1],["손길을",1],["이었다.",1],["강",0],["건너",0],["불을",0],["불구경으로",0],["만들지",0],["않는",0],["시민들",0],["사이의",0],["비범한",0],["연결.",0],["재난",0],["실황이",0],["생중계되는",0],["시대에",0],["선량한",0],["어른의",0],["어떤",0],["기억은,",0],["영화에서나마",0],["이렇게",0],["승화했다.",0],["<엑시트>의",0],["진짜",0],["힘은",0],["‘본다’는",0],["행위와",0],["이",0],["시대",0],["기술을",0],["한국인의",0],["집단기억과",0],["만나게",0],["한",0],["다음",0],["따뜻한",0],["오락영화로",0],["거듭나게",0],["한",0],["데",0],["있다.",0],["<br/>",0],["<br/>",0],["재난영화에서",0],["여성의",0],["자리",0],["<br/>",0],["<br/>",0],["재난영화로서",1],["<엑시트>가",1],["여성을",1],["담은",1],["방식",1],["역시",0],["충분한",0],["평가가",0],["필요해",0],["보인다.",0],["의주는",0],["잘",0],["달린다.",0],["한국영화",0],["스크린",0],["속에서",0],["가장",0],["잘",0],["뛴",0],["여성",0],["중",0],["한명일",0],["것이다.",0],["거의",0],["모든",0],["운동의",0],["기본은",0],["어깨에서",0],["힘",0],["빼기다.",0],["전력달리기의",0],["기본은",0],["앞쪽",0],["무릎을",0],["최대한",0],["높이고",0],["뒤쪽",0],["무릎은",0],["충분히",0],["뒤로",0],["뻗는",0],["것이다.",0],["이로써",0],["윤아는",0],["영화의",0],["속도에",0],["걸맞은",0],["인물의",0],["속력을",0],["확보한다.",0],["그녀의",0],["달리기",0],["자세는",0],["<엑시트>의",0],["제작",0],["태도이기도",0],["하다.",0],["어깨에",1],["힘",1],["빼고",1],["기본에",1],["충실하기.",1],["한국",0],["상업영화에서",0],["여성이",0],["피보호자나",0],["요(要)구조자의",0],["위치에서",0],["벗어나고",0],["있다는",0],["점은",0],["이제",0],["새삼스럽지",0],["않지만,",0],["충무로",0],["재난",0],["소재",0],["영화에서라면",0],["얘기가",0],["다르다.",0],["절체절명의",0],["상황에서",0],["남성의",0],["손길에",0],["매달려야",0],["하는",0],["처지에",0],["머물기",0],["일쑤였다.",0],["도입부에서",0],["의주의",0],["암벽등반",0],["실력이",0],["용남보다",0],["한수",0],["위였음을",0],["일러둔",0],["<엑시트>는,",0],["그녀에게",0],["재난",0],["대피와",0],["구조신호",0],["송출에",0],["지휘자",0],["역할을",0],["맡긴다.",0],["그러고는",0],["달리고",0],["매달리고",0],["기어오르는",0],["액션을",0],["용남과",0],["동등하게",0],["치르도록",0],["한다.",0],["사태",0],["해결",0],["뒤",0],["키스나",0],["포옹",0],["장면을",0],["넣지",0],["않은",0],["선택은",0],["말할",0],["것도",0],["없다.",0],["<br/>",0],["<br/>",0],["헬기",0],["탑승",0],["제한",0],["상황에서",0],["폼나게",0],["양보하기.",0],["이때",0],["상대방에게",0],["눈물일랑",0],["보이지",0],["않기.",0],["그러다",0],["들통나기.",0],["이로써",0],["관객에게",0],["웃음",0],["주기.",0],["이를테면",0],["한국",0],["관객은",0],["조진웅이나",0],["조정석",0],["같은",0],["배우에게서",0],["이런",0],["연기를",0],["기대한다.",0],["감정을",0],["들켜",0],["웃음을",0],["전하는",0],["역할을",0],["여성에게",0],["맡기는",0],["경우는",0],["대개",0],["그녀가",0],["조연일",0],["때다.",0],["이를테면",0],["한국",0],["관객은",0],["김지영(용남의",0],["큰누나",0],["정현",0],["역)",0],["같은",0],["배우에게서",0],["이런",0],["연기를",0],["기대한다.",0],["이같은",0],["유머",0],["코드는",0],["그간",0],["숱한",0],["코미디에서",0],["응용문제",0],["풀듯",0],["활용해온",0],["설정이지만,",0],["대개",0],["남성",0],["캐릭터가",0],["전유해왔다는",0],["점을",0],["환기시켜주는",0],["인물이",0],["의주다.",0],["<엑시트>는",1],["위기",1],["극복의",1],["주체로서뿐",1],["아니라",1],["부재와",1],["결핍의",1],["유머",1],["영역까지",1],["여성",1],["주연이",1],["설",1],["자리를",1],["넓혔다.",1],["<br/>",0],["<br/>",0],["2019년",0],["8월",0],["한국영화",0],["시장은",0],["이례적이다.",0],["여름",0],["대목을",0],["한편의",0],["승자가",0],["독식하지",0],["않고",0],["1,",0],["2위",0],["작품이",0],["매일",0],["박빙의",0],["승부를",0],["펼치는",0],["경우도",0],["드문데,",0],["이들",0],["두편의",0],["세계관이",0],["적잖이",0],["다르다는",0],["점",0],["또한",0],["흥미롭다.",0],["얼핏",0],["＜봉오동",0],["전투＞의",0],["이분법적",0],["서사가",0],["지금의",0],["정세와",0],["맞물리는",0],["듯",0],["보이지만,",0],["정치나",0],["언론",0],["영역보다",0],["몇수",0],["앞서가며",0],["불매운동을",0],["진화시켜나가는",0],["시민들의",0],["자발적",0],["움직임은",0],["＜엑시트＞의",0],["그것과",0],["닮아",0],["있다.",0],["물론",0],["이들의",0],["흥행",0],["승부",0],["결과보다",0],["더",0],["궁금한",0],["건",0],["이상근",0],["감독의",0],["다음",0],["작품이다.",0]]`;

const ReadTypeB = withRouter(({ history }) => {
  const data = news;
  const [text, setText] = useState([]);
  const [funcOn, setFuncOn] = useState(true);
  const [focusOn, setFocusOn] = useState(false);
  const [mode, setMode] = useState(0); // 보여줄 score를 의미. -1일 경우는 아직 사용 안함
  const target = useRef();

  useEffect(() => {
    // init
    const fetchText = localStorage.getItem("highlighttypeb");
    let preHighlight;
    if (fetchText) {
      preHighlight = JSON.parse(fetchText);
    } else {
      preHighlight = JSON.parse(PREHIGHLIGHT_NEWS);
    }
    setText(preHighlight.map((item) => [...item, 0]));
  }, [data]);

  const handleMode = (e) => {
    if (funcOn) {
      const eMode = Number(e.target.dataset.value);
      setMode(eMode);
    }
  };

  const handleFocusOnOff = (e) => {
    if (funcOn) {
      setFocusOn((v) => !v);
    }
  };

  const getDummyText = () => {
    localStorage.setItem("prehighlight", PREHIGHLIGHT_NEWS);
    const preHighlight = JSON.parse(PREHIGHLIGHT_NEWS);
    setText(preHighlight.map((item) => [...item, 0]));
  };

  const focusWord = (idx) => {
    const element = document.getElementById(idx);
    const customOffset = 250;
    const elementPosition = element.getBoundingClientRect().top;

    window.scrollTo({
      top: window.pageYOffset + elementPosition - customOffset,
      behavior: "smooth",
    });

    element.classList.add("focus-word");
    element.onanimationend = (e) => {
      e.target.classList.remove("focus-word");
    };
  };

  const handleBack = (e) => {
    history.push("/create/b");
  };
  return (
    <Wrapper>
      <div ref={target} className="text-area">
        <div className="text-wrapper">
          {text.map((item, idx) => {
            if (item[0] === "<br/>") {
              return <br key={idx} />;
            } else {
              return (
                <Word
                  key={idx}
                  id={idx}
                  text={item[0]}
                  score={item[1]}
                  showLevel={mode}
                  focusOn={focusOn}
                />
              );
            }
          })}
        </div>
      </div>
      <Draggable bounds="body">
        <LevelControl className="box">
          <div className="title">중첩 단계별 보기</div>
          <Button
            data-value={3}
            className={funcOn && mode === 3 ? "applied" : "not-applied"}
            onClick={handleMode}
          >
            중첩 3단계
          </Button>

          <Button
            data-value={2}
            className={funcOn && mode === 2 ? "applied" : "not-applied"}
            onClick={handleMode}
          >
            중첩 2단계
          </Button>
          <Button
            data-value={1}
            className={funcOn && mode === 1 ? "applied" : "not-applied"}
            onClick={handleMode}
          >
            중첩 1단계
          </Button>

          <Button
            data-value={0}
            className={funcOn && mode === 0 ? "applied" : "not-applied"}
            onClick={handleMode}
          >
            원본
          </Button>
          <Button
            className={funcOn && focusOn ? "applied" : "not-applied"}
            onClick={handleFocusOnOff}
          >
            선택된 단계만 보기
          </Button>
        </LevelControl>
      </Draggable>
      <Draggable handle="strong" bounds="body">
        <HistogramWrapper className="box no-cursor">
          <strong>
            <div className="title">요약 히스토그램</div>
          </strong>
          <Histogram data={text} focusWord={focusWord} />
        </HistogramWrapper>
      </Draggable>
      <Draggable bounds="body">
        <Control className="box">
          <div className="title">텍스트 요약</div>
          <Button className="not-applied" onClick={handleBack}>
            다시하기
          </Button>
        </Control>
      </Draggable>
    </Wrapper>
  );
});

export default ReadTypeB;
